In [1]:
import pandas as pd
data = {'0':['Tom', 'nick', 'krish', 'jack','asghar','akbar','gholi','ali','zahra'],
        '1':[20, 21, 19, 18,32,29,40,17,17],
        '2':[29,40,32,17,19,20,21,18,6]}
df = pd.DataFrame(data)
print(df)

        0   1   2
0     Tom  20  29
1    nick  21  40
2   krish  19  32
3    jack  18  17
4  asghar  32  19
5   akbar  29  20
6   gholi  40  21
7     ali  17  18
8   zahra  17   6

In [2]:
b=df.sample(n=3)
b

        0   1   2
7     ali  17  18
8   zahra  17   6
4  asghar  32  19

In [3]:
h=[]
for j in range(len(b)):
    for i in range(len(df)):
        if b.values[j,2]==df.values[i,1]:
            if b.values[j,1]==df.values[i,2]:
                h.append(df.values[i])

In [4]:
h

[array(['jack', 18, 17], dtype=object), array(['krish', 19, 32], dtype=object)]

In [52]:
#h=pd.DataFrame(h)

In [91]:
#f=pd.concat([b,h],ignore_index=True).drop_duplicates().reset_index(drop=True)

In [5]:
b=b.values.tolist()

In [6]:
f=b+h

In [7]:
f

[['ali', 17, 18],
 ['zahra', 17, 6],
 ['asghar', 32, 19],
 array(['jack', 18, 17], dtype=object),
 array(['krish', 19, 32], dtype=object)]

In [8]:
f=pd.DataFrame(f)

In [9]:
f

        0   1   2
0     ali  17  18
1   zahra  17   6
2  asghar  32  19
3    jack  18  17
4   krish  19  32